[
    {
        "email": "enamahmedshahaz@gmail.com",
        "title": "Math Quiz",
        "difficultyLevel": "easy",
        "dueDate": "2023-11-01T15:40:14.000Z",
        "thumbnail": "https://picsum.photos/200/200?random=1",
        "marks": 10,
        "description": "Solve a variety of basic math problems to test your mathematical skills. This quiz covers topics such as arithmetic, algebra, and geometry. You'll have the opportunity to practice addition, subtraction, multiplication, and division, as well as solve simple equations. The quiz consists of multiple-choice and open-ended questions, providing a well-rounded assessment of your math knowledge. Whether you're a student looking to reinforce your math skills or simply want to challenge yourself, this assignment is an excellent choice."
    },
    {
        "email": "enamahmedshahaz@gmail.com",
        "title": "History Presentation",
        "difficultyLevel": "medium",
        "dueDate": "2023-11-05T12:00:00.000Z",
        "thumbnail": "https://picsum.photos/200/200?random=2",
        "marks": 20,
        "description": "Prepare a comprehensive presentation on a historical event or period of your choice. You'll have the opportunity to delve deep into the historical context, analyze the impact of key events and figures, and present your findings in an engaging and informative manner. This assignment allows you to showcase your research and presentation skills. You can choose any historical topic that interests you, whether it's an ancient civilization, a significant war, or a pivotal moment in history. Share your knowledge and insights with your peers and gain a deeper understanding of the past."
    },
    {
        "email": "enamahmedshahaz@gmail.com",
        "title": "Programming Assignment",
        "difficultyLevel": "hard",
        "dueDate": "2023-11-10T18:30:00.000Z",
        "thumbnail": "https://picsum.photos/200/200?random=3",
        "marks": 30,
        "description": "Embark on a challenging programming journey with this assignment. You'll be tasked with tackling a complex real-world problem using your coding skills. Whether you're a seasoned programmer or looking to push your limits, this assignment will test your problem-solving abilities and programming prowess. You have the flexibility to choose your preferred programming language, and the assignment will assess your ability to write efficient and maintainable code. Dive into the world of algorithms and data structures to craft a solution that stands out. This assignment is an excellent opportunity to sharpen your coding skills and tackle a challenging problem."
    },
    {
        "email": "enamahmedshahaz@gmail.com",
        "title": "Literature Review",
        "difficultyLevel": "medium",
        "dueDate": "2023-11-15T14:15:00.000Z",
        "thumbnail": "https://picsum.photos/200/200?random=4",
        "marks": 25,
        "description": "Immerse yourself in the world of literature by creating a comprehensive literature review. Choose a book or academic article that piques your interest and delve deep into its content. Analyze the themes, characters, writing style, and impact of the selected work. This assignment provides an opportunity for critical thinking, in-depth research, and scholarly writing. You'll craft a well-structured review that showcases your understanding and interpretation of the chosen literary piece. Whether you're a literature enthusiast or aiming to improve your analytical and writing skills, this assignment offers a rich and rewarding experience."
    },
    {
        "email": "enamahmedshahaz@gmail.com",
        "title": "Chemistry Quiz",
        "difficultyLevel": "easy",
        "dueDate": "2023-11-20T16:45:00.000Z",
        "thumbnail": "https://picsum.photos/200/200?random=5",
        "marks": 15,
        "description": "Put your chemistry knowledge to the test with this engaging quiz. Covering fundamental concepts in chemistry, this quiz includes questions on elements, chemical reactions, and the periodic table. You'll have the opportunity to review topics such as atomic structure, chemical bonding, and the properties of matter. Whether you're a student preparing for a chemistry exam or simply curious about the world of molecules and compounds, this quiz offers a fun and educational experience. Answer multiple-choice and open-ended questions to assess your understanding of the chemical world. Challenge yourself and discover the wonders of chemistry."
    },
    {
        "email": "enamahmedshahaz@gmail.com",
        "title": "Group Project Proposal",
        "difficultyLevel": "medium",
        "dueDate": "2023-11-25T13:30:00.000Z",
        "thumbnail": "https://picsum.photos/200/200?random=6",
        "marks": 20,
        "description": "Collaboration and teamwork are essential skills in today's world. In this assignment, you'll work with your peers to create a detailed proposal for a group project. Select a project topic that interests your team and outline the project's objectives, scope, and timeline. This proposal is an opportunity to showcase your ability to plan and organize group work effectively. You'll define roles and responsibilities, set clear goals, and create a project plan. Communication and collaboration will be key to your success. Whether you're preparing for future group projects or want to develop your project management skills, this assignment provides a practical and interactive learning experience."
    },
    {
        "email": "enamahmedshahaz@gmail.com",
        "title": "Physics Assignment",
        "difficultyLevel": "hard",
        "dueDate": "2023-12-01T11:20:00.000Z",
        "thumbnail": "https://picsum.photos/200/200?random=7",
        "marks": 35,
        "description": "Take on the challenge of solving advanced physics problems with this comprehensive assignment. Explore topics such as classical mechanics, electromagnetism, and thermodynamics. You'll tackle complex physics concepts and demonstrate your problem-solving skills. This assignment offers a range of problems that will test your understanding of the physical world. Whether you're a physics enthusiast or a student looking to excel in your coursework, this assignment will help you deepen your knowledge and sharpen your analytical abilities. Dive into the world of equations, experiments, and theories and embark on a physics adventure."
    },
    {
        "email": "enamahmedshahaz@gmail.com",
        "title": "Art Project",
        "difficultyLevel": "medium",
        "dueDate": "2023-12-05T17:00:00.000Z",
        "thumbnail": "https://picsum.photos/200/200?random=8",
        "marks": 25,
        "description": "Unleash your creativity and artistic skills with this exciting art project. You have the freedom to choose your preferred medium, whether it's painting, drawing, sculpture, or digital art. Express your thoughts and emotions through your artwork and create a piece that resonates with your artistic vision. This assignment encourages self-expression, experimentation, and the exploration of different artistic techniques. Share your artwork with your peers and embrace the diversity of artistic styles within your group. Whether you're an experienced artist or a beginner, this project provides an opportunity to showcase your artistic talents and connect with the world of art."
    },
    {
        "email": "enamahmedshahaz@gmail.com",
        "title": "Geography Quiz",
        "difficultyLevel": "easy",
        "dueDate": "2023-12-10T19:30:00.000Z",
        "thumbnail": "https://picsum.photos/200/200?random=9",
        "marks": 12,
        "description": "Travel the world from the comfort of your desk with this geography quiz. Test your knowledge of countries, capitals, and geographic features. You'll answer questions about continents, landmarks, and world geography. This quiz is a fantastic way to enhance your geographical awareness and learn about the diverse cultures and landscapes of our planet. Whether you're a geography enthusiast or just curious about the world, this quiz offers an enjoyable and educational experience. Explore the globe, challenge your friends, and discover the wonders of our world."
    },
    {
        "email": "enamahmedshahaz@gmail.com",
        "title": "Group Presentation",
        "difficultyLevel": "medium",
        "dueDate": "2023-12-15T14:45:00.000Z",
        "thumbnail": "https://picsum.photos/200/200?random=10",
        "marks": 22,
        "description": "Enhance your public speaking and collaboration skills with this group presentation assignment. Form a team with your peers and select a captivating topic to present. This assignment requires effective communication, teamwork, and the ability to engage your audience. You'll prepare and deliver a compelling presentation, incorporating visual aids and persuasive arguments. Whether you're preparing for future presentations or want to refine your communication skills, this assignment provides a platform for growth. Share your knowledge, convey your ideas, and captivate your audience with your group presentation."
    },
    {
        "email": "enamahmedshahaz@gmail.com",
        "title": "Economics Assignment",
        "difficultyLevel": "hard",
        "dueDate": "2023-12-20T10:10:00.000Z",
        "thumbnail": "https://picsum.photos/200/200?random=11",
        "marks": 30,
        "description": "Dive into the world of economics with this challenging assignment. You'll analyze economic trends, conduct in-depth research, and present your findings in a comprehensive report. Explore topics such as supply and demand, market structures, and macroeconomic indicators. This assignment offers an opportunity to showcase your analytical and research skills, as well as your ability to interpret economic data. Whether you're an economics enthusiast or a student aiming to excel in your coursework, this assignment provides a platform for deepening your understanding of economic principles. Investigate economic phenomena, explore real-world scenarios, and present your insights in a well-structured report."
    },
    {
        "email": "enamahmedshahaz@gmail.com",
        "title": "Language Quiz",
        "difficultyLevel": "easy",
        "dueDate": "2023-12-25T16:20:00.000Z",
        "thumbnail": "https://picsum.photos/200/200?random=12",
        "marks": 15,
        "description": "Challenge your language skills with this engaging quiz that focuses on vocabulary and grammar. Test your knowledge of synonyms, antonyms, word usage, and sentence structure. You'll encounter questions that span a variety of languages and linguistic concepts. Whether you're a language enthusiast or a student looking to improve your language skills, this quiz offers an opportunity to expand your vocabulary and enhance your grammatical understanding. Answer multiple-choice questions and explore the nuances of language. Dive into the world of words and syntax and enrich your linguistic abilities."
    },
    {
        "email": "enamahmedshahaz@gmail.com",
        "title": "Psychology Project",
        "difficultyLevel": "medium",
        "dueDate": "2023-12-30T12:55:00.000Z",
        "thumbnail": "https://picsum.photos/200/200?random=13",
        "marks": 23,
        "description": "Embark on a fascinating psychological journey with this research project. You'll select a psychological topic of your choice and conduct in-depth research, analysis, and experimentation. This project allows you to explore the intricacies of the human mind, behavior, and mental processes. You'll design experiments, collect data, and interpret your findings in a well-structured report. Whether you're a psychology enthusiast or a student looking to delve into the field of psychology, this project offers a platform for gaining insights into the complexities of the human psyche. Explore psychological phenomena, conduct research, and present your discoveries in a thought-provoking report."
    },
    {
        "email": "enamahmedshahaz@gmail.com",
        "title": "Computer Science Assignment",
        "difficultyLevel": "hard",
        "dueDate": "2024-01-05T09:30:00.000Z",
        "thumbnail": "https://picsum.photos/200/200?random=14",
        "marks": 40,
        "description": "Embark on a challenging computer science assignment that will push the boundaries of your programming skills. You have the opportunity to develop a software application or tackle a complex problem in the field of computer science. This assignment requires you to select a real-world problem, design a solution, and implement it using your preferred programming language. You'll need to consider issues such as efficiency, scalability, and user-friendliness. Whether you're a computer science enthusiast or a student aiming to excel in your coursework, this assignment offers an excellent opportunity to showcase your programming expertise. Dive into the world of algorithms, data structures, and software development, and demonstrate your ability to solve complex problems."
    },
    {
        "email": "enamahmedshahaz@gmail.com",
        "title": "Music Composition",
        "difficultyLevel": "medium",
        "dueDate": "2024-01-10T13:10:00.000Z",
        "thumbnail": "https://picsum.photos/200/200?random=15",
        "marks": 28,
        "description": "Express your creativity and musical talents with this music composition project. You have the freedom to create a piece of music in your chosen style and genre. Whether you prefer classical, jazz, rock, or electronic music, this assignment allows you to compose and notate your original composition. Share your musical composition with your peers and receive feedback on your artistic work. Whether you're a seasoned musician or a beginner, this project offers an opportunity to unleash your musical creativity and connect with the world of sound and melody."
    },
    {
        "email": "enamahmedshahaz@gmail.com",
        "title": "Environmental Science Quiz",
        "difficultyLevel": "easy",
        "dueDate": "2024-01-15T15:50:00.000Z",
        "thumbnail": "https://picsum.photos/200/200?random=16",
        "marks": 12,
        "description": "Explore the fascinating world of environmental science with this quiz. Test your knowledge of ecological concepts, sustainability, and environmental issues. You'll answer questions about ecosystems, conservation, and the impact of human activities on the environment. This quiz is an excellent way to gain a deeper understanding of the natural world and the importance of environmental conservation. Whether you're an environmental enthusiast or simply curious about the planet's ecosystems."
    }
]